app/views/recipes/_form.html.erb

SELECT "cities".* FROM "cities"
---
    <%= f.select(:city) do %>
      <% City.all.each do |city| -%>