app/views/pages/home.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."status" = ?  [["status", 2]]
---
    <div class="container">
			<% Recipe.where(status:2).limit(3).each do |recipe| %>

SELECT "recipes".* FROM "recipes" ORDER BY created_at
---
    <div class="container">
			<% Recipe.limit(12).each do |recipe| %>