app/controllers/cities_controller.rb

  def showByCity
    ## Uncomment to set city search engine
    # @city = City.search(params[:name]).first
    ## Delete to set city search engine
    @city = City.find(params[:name])

    @search = {
      # city: @city.id,
      smcd: params[:smcd],
      difficulty: params[:difficulty],
      season: params[:season]
    }
    @search.delete :smcd if @search[:smcd] == "all"
    @search.delete :difficulty if @search[:difficulty] == "all"
    @search.delete :season if @search[:season] == "all"
    @recipes = Recipe.where(@search)
---
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = ? ORDER BY "cities"."id" ASC LIMIT ?  [["name", "bordeaux"], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."smcd" IS NULL AND "recipes"."difficulty" IS NULL AND "recipes"."season" IS NULL