app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT "cities".* FROM "cities" WHERE (content LIKE '%d%') ORDER BY created_at DESC

  def show
    @home = true

    @city = City.find(params[:id])

    @search = {
      city: @city.id,
      smcd: params[:smcd],
      difficulty: params[:difficulty],
      season: params[:season]
    }
    # No comment...
    @search.delete :smcd if @search[:smcd] == "all"
    @search.delete :smcd unless @search[:smcd]
    @search.delete :difficulty if @search[:difficulty] == "all"
    @search.delete :difficulty unless @search[:difficulty]
    @search.delete :season if @search[:season] == "all"
    @search.delete :season unless @search[:season]

    @recipes = Recipe.where(@search) if @search
    @recipes = Recipe.where(city: @city) unless @search
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."city" = ? AND "recipes"."smcd" = ? AND "recipes"."difficulty" = ? AND "recipes"."season" = ?  [["city", "1"], ["smcd", "starter"], ["difficulty", 1], ["season", "automn"]]

  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("name", "description", "status", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @city.update(city_params)
---
UPDATE "cities" SET "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ?, "image_file_name" = ? WHERE "cities"."id" = ?  [["image_file_size", 1501704], ["image_updated_at", 2017-01-03 08:26:11 UTC], ["updated_at", 2017-01-03 08:26:14 UTC], ["image_file_name", "patrimoine_03_1.jpg"], ["id", 1]]

  def destroy
    @city.destroy
---
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 2]]