app/controllers/pages_controller.rb

SELECT "cities".* FROM "cities"
SELECT  "cities".* FROM "cities" WHERE "cities"."status" = ? LIMIT ?  [["status", 2], ["LIMIT", 5]]
SELECT  "recipes".* FROM "recipes" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."status" = ? LIMIT ?  [["status", 2], ["LIMIT", 5]]
SELECT  "recipes".* FROM "recipes" ORDER BY "recipes"."id" DESC LIMIT ?  [["LIMIT", 3]]
---
   def home
     @cities = City.all
     @citiesStared = City.where(status:2).limit(5)
     @recipes = Recipe.all
     @recipesStared = Recipe.where(status:2).limit(5)
     @recipesLast = Recipe.last(3).reverse