app/controllers/recipes_controller.rb

  def show
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("name", "city", "description", "ingredients", "recipe", "prepare", "cook", "smcd", "difficulty", "status", "season", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "smcd" = ?, "difficulty" = ?, "season" = ?, "status" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["smcd", "starter"], ["difficulty", 1], ["season", "winter"], ["status", 1], ["updated_at", 2017-05-14 09:14:39 UTC], ["id", 1]]